schmmd/soleCAN/embedded/esp32-s3/src/main.cpp
/*
 * Solectrac CAN monitor for ESP32
 *
 * Reads J1939 CAN frames from the Solectrac 25G tractor (250 kbit/s) via the
 * ESP32's built-in TWAI peripheral, decodes all known signals, and serves
 * them as JSON over a simple HTTP endpoint.
 *
 * Hardware:
 *   Connect a CAN transceiver (SN65HVD230, TJA1050, MCP2551) between the
 *   ESP32 and the CAN bus. Adjust CAN_TX_PIN and CAN_RX_PIN below to match
 *   your wiring.
 *
 * Endpoints:
 *   GET /       — mobile-friendly dashboard (auto-refreshing)
 *   GET /json   — raw JSON
 *   anything else 302-redirects to / (captive-portal auto-open on the AP)
 */

#include <Arduino.h>
#include <WiFi.h>
#include <ESPmDNS.h>
#include <DNSServer.h>
#include <WebServer.h>
#include <ArduinoJson.h>
#include <BLEDevice.h>
#include <BLEServer.h>
#include <BLEUtils.h>
#include <BLE2902.h>
#include "driver/twai.h"
#include <sys/select.h>
#if defined(BOARD_LILYGO_T2CAN)
  #include <SPI.h>
  #include <ACAN2515.h>
#endif
#if defined(BOARD_REJSACAN)
  // Onboard microSD session logging (see the "SD-card session logging" section).
  #include <SPI.h>
  #include <SD.h>
  #include <esp_timer.h>
  #include <esp_heap_caps.h>
  #include "freertos/stream_buffer.h"
#endif

// ── Configuration ─────────────────────────────────────────────────────────────

// Optional home network the board also joins (for bench use). Leave unset to
// run AP-only — the board still broadcasts its own hotspot (see AP_SSID below),
// which is the stable default for field use. Set both to join a network.
#ifndef WIFI_SSID
#define WIFI_SSID ""
#endif
#ifndef WIFI_PASS
#define WIFI_PASS ""
#endif

// ── CAN transmit / bus mode ───────────────────────────────────────────────────
// Safe by default: both CAN controllers come up in *listen-only* mode, so the
// hardware physically cannot drive the bus — no ACKs, no error frames, no
// injection. This makes the stock firmware a true passive tap; a bug in a
// transmit path can't perturb the bus because the silicon never drives a bit.
//
// Build with -DCAN_ALLOW_TX to switch both controllers to NORMAL mode. That
// makes them ACK received frames AND arms every transmit path — SLCAN t/T
// injection over USB and socketcand `< send >` over WiFi. Only build this way
// when you intend to write to the bus. Note: in listen-only mode a two-node
// bench setup gets no ACKs (the lone talker retransmits and eventually goes
// bus-off); on the tractor's four-ECU bus the real nodes ACK each other.
#if defined(CAN_ALLOW_TX)
  #define CAN_TX_ENABLED 1
#else
  #define CAN_TX_ENABLED 0
#endif

// Per-board pin map. Selected via -DBOARD_* in platformio.ini.
#if defined(BOARD_ADAFRUIT_FEATHER_S3)
  #define CAN_TX_PIN       GPIO_NUM_8
  #define CAN_RX_PIN       GPIO_NUM_14
  #define LED_PIN          GPIO_NUM_33
  #define LED_POWER_PIN    GPIO_NUM_21
  #define LED_IS_NEOPIXEL  1
#elif defined(BOARD_LILYGO_T2CAN)
  // LilyGo T-2CAN exposes both CAN ports: CAN B is the ESP32-S3's native TWAI
  // on GPIO 6/7; CAN A is an MCP2515 on SPI. We stream both buses out
  // over socketcand as channels can0 (TWAI) and can1 (MCP2515).
  // pin_config.h documents no user-controllable LED.
  #define CAN_TX_PIN       GPIO_NUM_7
  #define CAN_RX_PIN       GPIO_NUM_6
  #define MCP2515_CS_PIN   GPIO_NUM_10
  #define MCP2515_SCK_PIN  GPIO_NUM_12
  #define MCP2515_MOSI_PIN GPIO_NUM_11
  #define MCP2515_MISO_PIN GPIO_NUM_13
  #define MCP2515_INT_PIN  GPIO_NUM_8
  // Active-low hardware reset, wired to the MCP2515 RESET pin. The ESP32 must
  // drive this high to bring the chip out of reset; left undriven the MCP2515
  // never answers SPI and ACAN2515::begin() returns kNoMCP2515 (err bit 0).
  #define MCP2515_RST_PIN  GPIO_NUM_9
  // MCP2515 crystal frequency. The LilyGo T-2CAN populates a 16 MHz can (the
  // stock firmware calls setBitrate() with the default 16 MHz clock).
  #define MCP2515_QUARTZ_HZ (16UL * 1000UL * 1000UL)
  #define HAS_MCP2515      1
  #define LED_IS_NEOPIXEL  0
#elif defined(BOARD_REJSACAN)
  // RejsaCAN-ESP32-S3 v3.x: ESP32-S3-WROOM-1-N16R8 driving a TJA1051-style
  // transceiver. Pin numbers come from the vendor's getall_s3.ino example.
  #define CAN_TX_PIN       GPIO_NUM_14
  #define CAN_RX_PIN       GPIO_NUM_13
  // CAN_RS controls the transceiver's mode: LOW = high-speed normal,
  // HIGH = listen-only/low-power. Leaving it floating puts the transceiver in
  // slope-control mode, which silently mangles 250/500 kbit/s frames.
  #define CAN_RS_PIN       GPIO_NUM_38
  // FORCE_ON keeps the auto-shutdown circuit from cutting power once the host
  // 12 V drops (the board is designed to ride out engine cranking / key-off).
  // Driving it high here means the firmware decides when to shut down, not the
  // hardware — convenient for continuous tractor capture.
  #define FORCE_ON_PIN     GPIO_NUM_17
  // Two user LEDs. Yellow carries warnings (no WiFi / CAN didn't init); blue
  // carries CAN-bus activity. Each is independently controlled — the board's
  // third LED is a hard-wired green power indicator we can't drive.
  #define WARN_LED_PIN     GPIO_NUM_11   // yellow
  #define ACTIVITY_LED_PIN GPIO_NUM_10   // blue
  #define LED_IS_DUAL_GPIO 1
  #define LED_IS_NEOPIXEL  0
  // 12 V input sense: an R18(120K)/R6(33K) divider off the protected VCC rail
  // feeds GPIO 9 (ADC1_CH8). Vin = Vadc × (R18+R6)/R6 = Vadc × 153/33 ≈ ×4.636.
  // With the default 12 dB attenuation the ADC saturates around ~14.4 V at the
  // VIN terminal — plenty for a 12 V tractor accessory rail.
  #define VIN_SENSE_PIN    GPIO_NUM_9
  #define VIN_DIVIDER_NUM  153    // (R18 + R6) in kΩ
  #define VIN_DIVIDER_DEN  33     // R6 in kΩ
  #define HAS_VIN_SENSE    1
  // Onboard microSD reader on a dedicated SPI bus. Pins verified against the
  // vendor's s3-sdcard.ino example and "RejsaCAN v3.4 - Pinout.h". They avoid
  // GPIO33–37, which the N16R8 module's octal PSRAM occupies — using those
  // would guru-meditate at boot. CS is the only signal unique to the card;
  // nothing else on this board is on SPI.
  #define SD_SCK_PIN       GPIO_NUM_39
  #define SD_MOSI_PIN      GPIO_NUM_40
  #define SD_MISO_PIN      GPIO_NUM_41
  #define SD_CS_PIN        GPIO_NUM_45
  #define HAS_SD           1
#else
  #error "Define a board: BOARD_ADAFRUIT_FEATHER_S3, BOARD_LILYGO_T2CAN, or BOARD_REJSACAN"
#endif

#ifndef LED_IS_DUAL_GPIO
  #define LED_IS_DUAL_GPIO 0
#endif

// WiFi runs in dual AP+STA mode: the board always broadcasts its own hotspot
// (so it's reachable in the field), and concurrently tries to join the
// configured home network for bench use. AP IP is 192.168.4.1. MDNS_NAME is
// the mDNS hostname the board advertises (MDNS_NAME.local).
//
// AP_SSID/AP_PASS/MDNS_NAME default to the values below. They can optionally
// be overridden at build time via environment variables (see .env.example);
// when unset, the build is unchanged.
#ifndef AP_SSID
#define AP_SSID "tractor"
#endif
#ifndef AP_PASS
#define AP_PASS "electricity"
#endif
#ifndef MDNS_NAME
#define MDNS_NAME "tractor"
#endif

// ── J1939 source addresses ────────────────────────────────────────────────────

